DROP TABLE IF EXISTS fish_records;

CREATE TABLE fish_records(
	first_name VARCHAR(20),
    last_name VARCHAR(20),
    common VARCHAR(50),
    location VARCHAR(100),
    state CHAR(2),
    weight VARCHAR(20),
    date DATE
);

INSERT INTO fish_records
VALUES
('Джордж', 'Перри', 'большеротый окунь', 'Монтгомери Лейк', 'GA', '22 фт 4 унц', '1932-06-02'),
('Мабри', 'Харпер', 'судак', 'Олд Хикори Лейк', 'TN', '25 фт 0 унц', '1960-08-02'),
('Джон', 'Скиммерхорн', 'лосось Кларка', 'Пирамид Лейк', 'NV', '41 фт 0 унц', '1925-12-01'),
('С.С.', 'Эббот', 'желтый окунь', 'Бордентаун', 'NJ', '4 фт 3 унц', '1865-05-01'),
('Т.С.', 'Хадсон', 'синежаберник', 'Кекона Лейк', 'AL', '4 фт 12 унц', '1950-04-09'),
('Таунсенд', 'Миллер', 'панцирник', 'Тринити Ривер', 'TX', '50 фт 5 унц', '1954-07-30'),
('Фред', 'Брайт', 'белый краппи', 'Дамба Энид', 'MS', '5 фт 3 унц', '1957-07-31'),
('Майк', 'Берг', 'красноперая щука', 'Дьюарт Лейк', 'IN', '1 фт 0 унц', '1990-06-09'),
('Флорентино', 'Абена', 'серебристый карась', 'Лейк Ходжес', 'CA', '6 фт 10 унц', '1996-04-17'),
('Лес', 'Андерсон', 'чавыча', 'Кенай Ривер', 'AK', '97 фт 4 унц', '1985-05-17');

SELECT *
FROM fish_records
WHERE state = 'NJ';